var counter = 0;

var timer = 0;

var blocks = ['⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️', '⬜️🔳⬜️🔳⬜️🔳⬜️🔳⬜️🔳⬜️', '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️', '⬜️🔳⬜️🔳⬜️🔳⬜️🔳⬜️🔳⬜️', '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️', '⬜️🔳⬜️🔳⬜️🔳⬜️🔳⬜️🔳⬜️', '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️', '⬜️🔳⬜️🔳⬜️🔳⬜️🔳⬜️🔳⬜️', '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️', '⬜️🔳⬜️🔳⬜️🔳⬜️🔳⬜️🔳⬜️', '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️', '⬜️🔳⬜️⬜️⬛️⬛️⬛️⬜️⬜️🔳⬜️', '⬜️⬜️⬜️⬜️⬛️⬛️⬛️⬜️⬜️⬜️⬜️'];

for (var line = 0; line < blocks.length; line++) {
	setTimeout(function () {

		console.log(blocks[counter]); 
		
		counter++;
		
	}, timer);
	timer += 70;

}
